{
  "information": {
    "firstName": "Pedro",
    "lastName": "Lemos",
    "bio": "Computer Scientist | Mobile Engineer",
    "shortDescription": "Mobile Developer",
    "fullDescription": "Mobile Developer focused on delivering impactful results through high-quality products. Eager to tackle challenging tasks and apply knowledge and creativity to craft intuitive user experiences. Committed to seamless collaboration with team members, believing in the principle of \"divide and conquer\" to achieve objectives. Always happy to help, teach, and learn from other skilled professionals. Passionate about state-of-the-art tools and methodologies, continuously striving to enhance overall quality.",
    "contacts": [
      {
        "name": "GitHub",
        "url": "https://github.com/pedrolemoz"
      },
      {
        "name": "LinkedIn",
        "url": "https://www.linkedin.com/in/pedrolemoz/"
      },
      {
        "name": "E-mail",
        "url": "mailto:lemozxpedro@gmail.com"
      },
      {
        "name": "Resume",
        "url": "https://raw.githubusercontent.com/pedrolemoz/pedrolemoz.github.io/master/assets/pedro_lemos_resume_english.pdf"
      }
    ]
  },
  "education": [
    {
      "institution": "Instituto Federal de Educação, Ciência e Tecnologia do Ceará",
      "degree": "Bachelor of Science",
      "field": "Computer Science",
      "startDate": "2019-01-01T00:00:00.000",
      "endDate": "2023-12-01T00:00:00.000",
      "description": "The final paper theme was \"Technical Analysis of Software Architectures in Application Development for Smartphones\". Teaching Assistant for the \"Programming Fundamentals\" course in the second semester of 2019. Presented a talk on the topic \"SOLID Principles: Good Practices in Software Development\" at the COMSOLID/SiC 2022 event.",
      "url": "https://ifce.edu.br/",
      "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRBZYzAHdhHGCmwUki5AoPxzNXP7Ism4ROjKKeaAVe9Ml0tHdy6kgAtrc9qjYHthWk1MmY&usqp=CAU",
      "logoFormat": "jpeg",
      "tags": [
        "Mobile Development",
        "Software Architecture",
        "Digital Image Processing",
        "Automata Theory",
        "Compilers"
      ]
    }
  ],
  "experiences": [
    {
      "startDate": "2024-09-28T00:00:00.000",
      "role": "Senior Software Engineer",
      "company": "banco BV",
      "description": "Developed key user flows in the personal loan and refinancing team, including interactive questionnaires to gather crucial customer data and personalize loan offerings. Implemented A/B testing pipelines using ConfigCat and Firebase Analytics, enabling iterative experimentation and improved user retention through dynamic content. Led a large-scale module refactoring, aligning the codebase with best practices and ensuring a consistent 80%+ test coverage, significantly improving maintainability and reliability. Managed CI/CD pipelines with Bitbucket, SonarQube, and Jenkins, optimizing the deployment process and reinforcing quality gates across the team.",
      "url": "https://www.bv.com.br/",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQFOjJQYVZoe6g/company-logo_200_200/company-logo_200_200/0/1719938558834/bancobv_logo?e=1747872000&v=beta&t=JLrunO4eopWsPzqiCKtvT6LBT5rKT1QWdFafXllRLjc",
      "logoFormat": "jpeg",
      "technologies": [
        "Flutter",
        "Dart",
        "Kotlin",
        "Swift",
        "Android",
        "iOS",
        "Clean Architecture",
        "CI/CD"
      ]
    },
    {
      "startDate": "2024-04-01T00:00:00.000",
      "endDate": "2024-09-01T00:00:00.000",
      "role": "Software Engineer",
      "company": "CloudWalk, Inc",
      "description": "Led growth-focused feature development, optimizing user conversions via strategic push notifications, in-app messages, and deep link flows. Implemented A/B Testing using the Amplitude Experiments SDK to evaluate user experiences, enabling new features for 50% of users. Developed a referral links section to increase the percentage of merchant users in the app. Delivered key compliance features, including a financial education hub and CNAE (similar to NAICS) update functionality, aligning with Brazilian Central Bank (BACEN) regulations. Enhanced UI performance by improving the home screen carousel animation for a smoother and more responsive experience. Integrated multiple messaging platforms, including Firebase Cloud Messaging (FCM), Iterable SDK, and Apple Push Notification Service (APNs), boosting communication reliability across Android and iOS. Worked on significant improvements across the app to leverage new features introduced in Dart 3, maximizing the potential of the language.",
      "url": "https://cloudwalk.io/",
      "logo": "https://media.licdn.com/dms/image/v2/D4D0BAQF1LcnKeI_UxQ/company-logo_200_200/company-logo_200_200/0/1738709971265/cloudwalk_inc_logo?e=1749686400&v=beta&t=8dVuNpluqNsVnIIs4ish15Ei8CgIFpBMMKh56_lMt8c",
      "logoFormat": "jpeg",
      "technologies": [
        "Flutter",
        "Dart",
        "Third-party SDKs",
        "Growth",
        "Marketing",
        "Onboarding",
        "Push notifications",
        "In-App notifications",
        "Deep links",
        "Kotlin",
        "Swift",
        "Android",
        "iOS",
        "Clean Architecture"
      ]
    },
    {
      "startDate": "2023-04-01T00:00:00.000",
      "endDate": "2024-04-01T00:00:00.000",
      "role": "Specialist Software Engineer",
      "company": "FTeam",
      "description": "Consulted for Nasajon, mentoring their dev team and guiding the architecture of the Gestão de Serviços app, improving team autonomy and code quality. Architected the foundation for Ship, an internal tool, by applying SOLID principles and Clean Architecture to reduce technical debt and streamline future development. Developed the App do Colportor for the Seventh-day Adventist Church, expanding their digital outreach and improving communication with field representatives. Implemented facial recognition in Ponto Mobile at Senior Sistemas, enhancing security and user authentication with cutting-edge mobile biometrics. Built a custom streaming platform for Centro Dom Bosco, delivering a smooth and engaging viewing experience for their audience.",
      "url": "https://www.fteam.dev/",
      "logo": "https://avatars.githubusercontent.com/u/63812934?s=1000",
      "logoFormat": "jpeg",
      "technologies": [
        "Flutter",
        "Dart",
        "ASP.NET Core",
        "Entity Framework",
        "C#",
        "Software Architecture",
        "Android",
        "iOS",
        "Firebase",
        "SOLID"
      ]
    },
    {
      "startDate": "2022-04-01T00:00:00.000",
      "endDate": "2022-12-01T00:00:00.000",
      "role": "Specialist Software Engineer",
      "company": "Compass.uol",
      "description": "Contributed to the development of white-label applications for 27 shopping malls managed by Ancar Ivanhoe in Brazil, enhancing customer experience and operational efficiency. Restructured the white-label application architecture by applying SOLID principles, ensuring a cleaner, more modular, and scalable codebase. Fixed critical bugs and improved the code in an application for São Salvador Alimentos, resulting in improved reliability and functionality.",
      "url": "https://compass.uol/en/home/",
      "logo": "https://media.licdn.com/dms/image/C4D0BAQHr82VdoHECSg/company-logo_200_200/0/1650283345676?e=2147483647&v=beta&t=1DL-YrRaIM4OsqL-b9OKHplYywzGASe1nSZbFoNeIN8",
      "logoFormat": "jpeg",
      "technologies": [
        "Flutter",
        "Dart",
        "Software Architecture",
        "Android",
        "iOS",
        "Firebase",
        "SOLID"
      ]
    },
    {
      "startDate": "2021-02-01T00:00:00.000",
      "endDate": "2022-04-01T00:00:00.000",
      "role": "Software Engineer",
      "company": "Code Tecnologia (currently Zydon)",
      "description": "Led the development of Farm, a white-label farm management app with an offline-first architecture and real-time synchronization with Sankhya ERP. Empowered field workers to operate in remote areas, optimizing resource use. Built and maintained PCM, a white-label machinery maintenance app, streamlining issue tracking and repair workflows for field technicians. Contributed to PEC, a B2B shopping platform that simplified procurement for business clients, enhancing operational efficiency. Defined and enforced a shared architectural standard across all apps, improving maintainability, scalability, and onboarding for new developers. Designed and rolled out Code UI, a reusable design system that unified UI/UX patterns across multiple products, improving user experience and development speed.",
      "url": "https://zydon.com.br/",
      "logo": "https://media.licdn.com/dms/image/C4D0BAQHlaGOiFLkDrg/company-logo_200_200/0/1673869723398/codetecio_logo?e=2147483647&v=beta&t=SMNgdfVeXzzr7lFHHdR6m2pt3b0KtWbK-JjV8deNmlo",
      "logoFormat": "jpeg",
      "technologies": [
        "Flutter",
        "Dart",
        "Software Architecture",
        "Android",
        "iOS",
        "Firebase",
        "SOLID"
      ]
    },
    {
      "startDate": "2020-06-01T00:00:00.000",
      "endDate": "2021-01-01T00:00:00.000",
      "role": "Software Engineer",
      "company": "MusicPlayce",
      "description": "Led the migration from native Android (Java) and iOS (Swift) apps to a unified Flutter codebase, following best practices to ensure performance, maintainability, and platform consistency. Developed core features including song upload, WhatsApp sharing, and interactive social validation tools, such as Instagram polls to gauge song reception and match songs with suitable artists. Delivered multiple user-facing features, enhancing collaboration between artists and songwriters and improving engagement across the platform.",
      "url": "https://musicplayce.com/",
      "logo": "https://media.licdn.com/dms/image/C4E0BAQHNaaNAAVYvWQ/company-logo_200_200/0/1630577598891/muiscplayce_logo?e=2147483647&v=beta&t=ErO7toIMSg00mAtg50vR5gGQS7hrLNRfeTav2I94zYg",
      "logoFormat": "jpeg",
      "technologies": [
        "Flutter",
        "Dart",
        "Software Architecture",
        "Android",
        "iOS",
        "Firebase",
        "SOLID"
      ]
    }
  ]
}
